import argparse
import vtsimnx as vt

materials = vt.materials

def main(hasp_path: str, lat: float, lon: float) -> None:
    df_i       = vt.read_hasp(hasp_path)
    solar      = vt.make_solar(df_i, lat = lat, lon = lon)

    room_volume = {
        '床下':         13.08,
        '和室':         39.75,
        'LD':           51.67,
        '台所':         19.25,
        '浴室':          7.45,
        '1階トイレ':     3.73,
        '洗面所':        7.45,
        'ホール':       32.30,
        'クローゼット': 11.92,
        '寝室':         31.80,
        '子供室1':      25.83,
        '子供室2':      25.84,
        '2階ホール':    27.29,
        '切妻':         47.70,
        '片流れ(3)':     5.82,
        '片流れ(4)':     1.13,
        '階間(L4)':     24.64,
        '2階トイレ':     3.97
    }

    layers = {
        '基礎外壁': [
            {'key': 'コンクリート',                     **materials['コンクリート'],                    't': 0.120}
        ],
        '外壁_一般部': [
            {'key': '木片セメント板',                   **materials['木片セメント板'],                  't': 0.015},
            {'key': '合板',                             **materials['合板'],                            't': 0.012},
            {'key': '住宅用グラスウール断熱材16K相当',  **materials['住宅用グラスウール断熱材16K相当'], 't': 0.076},
            {'key': '中空層',                           **materials['中空層(1cm以上)'],                 't': 1.000},
            {'key': 'せっこうボード',                   **materials['せっこうボード'],                  't': 0.0095}
        ],
        '外壁_熱橋部': [
            {'key': '木片セメント板',                   **materials['木片セメント板'],                  't': 0.015},
            {'key': '合板',                             **materials['合板'],                            't': 0.012},
            {'key': '天然木材1類(桧、杉、えぞ松等)',    **materials['天然木材1類(桧、杉、えぞ松等)'],   't': 0.100},
            {'key': 'せっこうボード',                   **materials['せっこうボード'],                  't': 0.0095}
        ],
        '外皮床_一般部': [
            {'key': '合板',                             **materials['合板'],                            't': 0.012},
            {'key': '住宅用グラスウール断熱材16K相当',  **materials['住宅用グラスウール断熱材16K相当'], 't': 0.082}
        ],
        '外皮床_熱橋部': [
            {'key': '合板',                             **materials['合板'],                            't': 0.012},
            {'key': '天然木材1類(桧、杉、えぞ松等)',    **materials['天然木材1類(桧、杉、えぞ松等)'],   't': 0.082}
        ],
        '外皮天井': [
            {'key': '住宅用グラスウール断熱材10K相当',  **materials['住宅用グラスウール断熱材10K相当'],  't': 0.171},
            {'key': 'せっこうボード',                   **materials['せっこうボード'],                   't': 0.0095}
        ],
        '間仕切壁': [
            {'key': 'せっこうボード',                   **materials['せっこうボード'],                  't': 0.0095},
            {'key': '中空層',                           **materials['中空層(1cm以上)'],                 't': 1.000},
            {'key': 'せっこうボード',                   **materials['せっこうボード'],                  't': 0.0125}
        ],
        '床': [
            {'key': '合板',                             **materials['合板'],                            't': 0.012}
        ],
        '天井': [
            {'key': 'せっこうボード',                   **materials['せっこうボード'],                  't': 0.0125}
        ],
        '屋根': [
            {'key': '合板',                             **materials['合板'],                            't': 0.012}
        ]
    }

    surface = {
        'E_基礎外壁': {'part': 'wall', 'layers': layers['基礎外壁'], 'solar': solar['日射熱取得量（東面）']},
        'N_基礎外壁': {'part': 'wall', 'layers': layers['基礎外壁'], 'solar': solar['日射熱取得量（北面）']},
        'S_基礎外壁': {'part': 'wall', 'layers': layers['基礎外壁'], 'solar': solar['日射熱取得量（南面）']},
        'W_基礎外壁': {'part': 'wall', 'layers': layers['基礎外壁'], 'solar': solar['日射熱取得量（西面）']},

        '0_外壁_一般部': {'part': 'wall', 'layers': layers['外壁_一般部']},
        'E_外壁_一般部': {'part': 'wall', 'layers': layers['外壁_一般部'], 'solar': solar['日射熱取得量（東面）']},
        'N_外壁_一般部': {'part': 'wall', 'layers': layers['外壁_一般部'], 'solar': solar['日射熱取得量（北面）']},
        'S_外壁_一般部': {'part': 'wall', 'layers': layers['外壁_一般部'], 'solar': solar['日射熱取得量（南面）']},
        'W_外壁_一般部': {'part': 'wall', 'layers': layers['外壁_一般部'], 'solar': solar['日射熱取得量（西面）']},
        'H_外壁_一般部': {'part': 'wall', 'layers': layers['外壁_一般部'], 'solar': solar['日射熱取得量（水平面）']},
        'D_外壁_一般部': {'part': 'wall', 'layers': layers['外壁_一般部'], 'solar': solar['日射熱取得量（拡散）']},

        '0_外壁_熱橋部': {'part': 'wall', 'layers': layers['外壁_熱橋部']},
        'E_外壁_熱橋部': {'part': 'wall', 'layers': layers['外壁_熱橋部'], 'solar': solar['日射熱取得量（東面）']},
        'N_外壁_熱橋部': {'part': 'wall', 'layers': layers['外壁_熱橋部'], 'solar': solar['日射熱取得量（北面）']},
        'S_外壁_熱橋部': {'part': 'wall', 'layers': layers['外壁_熱橋部'], 'solar': solar['日射熱取得量（南面）']},
        'W_外壁_熱橋部': {'part': 'wall', 'layers': layers['外壁_熱橋部'], 'solar': solar['日射熱取得量（西面）']},
        'H_外壁_熱橋部': {'part': 'wall', 'layers': layers['外壁_熱橋部'], 'solar': solar['日射熱取得量（水平面）']},
        'D_外壁_熱橋部': {'part': 'wall', 'layers': layers['外壁_熱橋部'], 'solar': solar['日射熱取得量（拡散）']},

        '外皮床_一般部': {'part': 'floor', 'layers': layers['外皮床_一般部'], 'alpha-o': 4.4},
        '外皮床_熱橋部': {'part': 'floor', 'layers': layers['外皮床_熱橋部'], 'alpha-o': 4.4},
        '外皮天井':      {'part': 'floor', 'layers': layers['外皮床_一般部'], 'alpha-o': 4.4},

        '間仕切壁':      {'part': 'wall',    'layers': layers['間仕切壁'], 'alpha-o': 4.4},
        '床':            {'part': 'floor',   'layers': layers['床'],       'alpha-o': 4.4},
        '天井':          {'part': 'ceiling', 'layers': layers['天井'],     'alpha-o': 4.4},
        '屋根':          {'part': 'ceiling', 'layers': layers['屋根'],     'alpha-o': 4.4},

        '室内建具':      {'part': 'wall', 'u_value': 2.33, 'alpha-o': 4.4},

        'E_窓':          {'part': 'glass', 'u_value': 4.65, 'eta': 0.90, 'solar': solar['日射熱取得量（東面ガラス）'], 'noctural': 10},
        'N_窓':          {'part': 'glass', 'u_value': 4.65, 'eta': 0.90, 'solar': solar['日射熱取得量（北面ガラス）'], 'noctural': 10},
        'S_窓':          {'part': 'glass', 'u_value': 4.65, 'eta': 0.90, 'solar': solar['日射熱取得量（南面ガラス）'], 'noctural': 10},
        'W_窓':          {'part': 'glass', 'u_value': 4.65, 'eta': 0.90, 'solar': solar['日射熱取得量（西面ガラス）'], 'noctural': 10},
    }

    input_data = {'simulation':           {},
                'nodes':                [],
                'ventilation_branches': [],
                'surfaces':             []}

    input_data['simulation'] = {
        'index': {
            'start': '2025-01-01 01:00:00', 'end':   '2025-01-01 10:00:00',
            'timestep': 3600, 'length':   10
        },
        'tolerance': {
            'ventilation': 1e-6, 'thermal': 1e-6, 'convergence': 1e-6
        }
    }

    input_data['nodes'] = [
        {'key': '外部',         't': df_i['外気温']},
        {'key': '床下',         'calc_t': True, 'thermal_mass': room_volume['床下']         * 12.6 * 1000},
        {'key': '和室',         'calc_t': True, 'thermal_mass': room_volume['和室']         * 12.6 * 1000},
        {'key': 'LD',           'calc_t': True, 'thermal_mass': room_volume['LD']           * 12.6 * 1000},
        {'key': '台所',         'calc_t': True, 'thermal_mass': room_volume['台所']         * 12.6 * 1000},
        {'key': '浴室',         'calc_t': True, 'thermal_mass': room_volume['浴室']         * 12.6 * 1000},
        {'key': '1階トイレ',    'calc_t': True, 'thermal_mass': room_volume['1階トイレ']    * 12.6 * 1000},
        {'key': '洗面所',       'calc_t': True, 'thermal_mass': room_volume['洗面所']       * 12.6 * 1000},
        {'key': 'ホール',       'calc_t': True, 'thermal_mass': room_volume['ホール']       * 12.6 * 1000},
        {'key': 'クローゼット', 'calc_t': True, 'thermal_mass': room_volume['クローゼット'] * 12.6 * 1000},
        {'key': '寝室',         'calc_t': True, 'thermal_mass': room_volume['寝室']         * 12.6 * 1000},
        {'key': '子供室1',      'calc_t': True, 'thermal_mass': room_volume['子供室1']      * 12.6 * 1000},
        {'key': '子供室2',      'calc_t': True, 'thermal_mass': room_volume['子供室2']      * 12.6 * 1000},
        {'key': '2階ホール',    'calc_t': True, 'thermal_mass': room_volume['2階ホール']    * 12.6 * 1000},
        {'key': '切妻',         'calc_t': True, 'thermal_mass': room_volume['切妻']         * 12.6 * 1000},
        {'key': '片流れ(3)',    'calc_t': True, 'thermal_mass': room_volume['片流れ(3)']    * 12.6 * 1000},
        {'key': '片流れ(4)',    'calc_t': True, 'thermal_mass': room_volume['片流れ(4)']    * 12.6 * 1000},
        {'key': '階間(L4)',     'calc_t': True, 'thermal_mass': room_volume['階間(L4)']     * 12.6 * 1000},
        {'key': '2階トイレ',    'calc_t': True, 'thermal_mass': room_volume['2階トイレ']    * 12.6 * 1000},
    ]

    input_data['ventilation_branches'] = [
        {'key': '外部->和室->ホール',                  'vol':   20     / 3600},
        {'key': '外部->台所->LD->ホール',              'vol':   20     / 3600},
        {'key': '外部->LD->ホール',                    'vol':   40     / 3600},
        {'key': 'ホール->外部',                        'vol':   80 / 3 / 3600},
        {'key': 'ホール->洗面所->外部',                'vol':   80 / 3 / 3600},
        {'key': 'ホール->1階トイレ->外部',             'vol':   80 / 3 / 3600},
        {'key': '外部->クローゼット->寝室->2階ホール', 'vol':   20     / 3600},
        {'key': '外部->寝室->2階ホール',               'vol':   20     / 3600},
        {'key': '外部->子供室1->2階ホール',            'vol':   20     / 3600},
        {'key': '外部->子供室2->2階ホール',            'vol':   20     / 3600},
        {'key': '2階ホール->2階トイレ->外部',          'vol':   40     / 3600},
        {'key': '2階ホール->外部',                     'vol':   40     / 3600},
        {'key': 'ホール->2階ホール->ホール',           'vol':  273     / 3600},
        {'key': 'LD->台所->LD',                        'vol': 5000     / 3600},
        {'key': '外部->台所->外部',                    'vol':  100     / 3600},
        {'key': '外部->ホール->洗面所->浴室->外部',    'vol':  100     / 3600},
        {'key': '外部->ホール->1階トイレ->外部',       'vol':  100     / 3600},
    ]

    input_data['surfaces'] = [
        #{'key': '床下->地盤'},
        {'key': '床下->外部||E_外壁',                **surface['E_基礎外壁'],    'area':  3.71},
        {'key': '床下->外部||N_外壁',                **surface['N_基礎外壁'],    'area':  0.7 + 0.46 + 3.48},
        {'key': '床下->外部||S_外壁',                **surface['S_基礎外壁'],    'area':  5.34},
        {'key': '床下->外部||W_外壁',                **surface['W_基礎外壁'],    'area':  0.96 + 1.86},

        {'key': '和室->外部||N_外壁_一般部',         **surface['N_外壁_一般部'], 'area':  2.18 * 0.83},
        {'key': '和室->外部||N_外壁_熱橋部',         **surface['N_外壁_熱橋部'], 'area':  2.18 * 0.17},
        {'key': '和室->外部||S_外壁_一般部',         **surface['S_外壁_一般部'], 'area': (10.92 - 4.59) * 0.83},
        {'key': '和室->外部||S_外壁_熱橋部',         **surface['S_外壁_熱橋部'], 'area': (10.92 - 4.59) * 0.17,},
        {'key': '和室->外部||W_外壁_一般部',         **surface['W_外壁_一般部'], 'area':  8.74 * 0.83},
        {'key': '和室->外部||W_外壁_熱橋部',         **surface['W_外壁_熱橋部'], 'area':  8.74 * 0.17},
        {'key': '和室->片流れ(4)||外壁_一般部',      **surface['0_外壁_一般部'], 'area':  3.31 * 0.83},
        {'key': '和室->片流れ(4)||外壁_熱橋部',      **surface['0_外壁_熱橋部'], 'area':  3.31 * 0.17},
        {'key': '和室->床下||床_一般部',             **surface['外皮床_一般部'], 'area': 16.56 * 0.83},
        {'key': '和室->床下||床_熱橋部',             **surface['外皮床_熱橋部'], 'area': 16.56 * 0.17},
        {'key': '和室->ホール||間仕切壁',            **surface['間仕切壁'],      'area':  3.28 - 1.422},
        {'key': '和室->階間(L4)||間仕切壁',          **surface['天井'],          'area': 13.25},
        {'key': '和室->LD||建具',                    **surface['室内建具'],      'area':  3.06},
        {'key': '和室->ホール||建具',                **surface['室内建具'],      'area':  1.422},
        {'key': '和室->外部||S_窓',                  **surface['S_窓'],          'area':  4.59},

        {'key': 'LD->外部||E_外壁_一般部',           **surface['E_外壁_一般部'], 'area': (8.74 - 2.145) * 0.83},
        {'key': 'LD->外部||E_外壁_熱橋部',           **surface['E_外壁_熱橋部'], 'area': (8.74 - 2.145) * 0.17},
        {'key': 'LD->外部||S_外壁_一般部',           **surface['S_外壁_一般部'], 'area': (14.2 - 3.465 - 3.465) * 0.83},
        {'key': 'LD->外部||S_外壁_熱橋部',           **surface['S_外壁_熱橋部'], 'area': (14.2 - 3.465 - 3.465) * 0.17},
        {'key': 'LD->床下||外皮床_一般部',           **surface['外皮床_一般部'], 'area': 21.53 * 0.83},
        {'key': 'LD->床下||外皮床_熱橋部',           **surface['外皮床_熱橋部'], 'area': 21.53 * 0.17},
        {'key': 'LD->和室||間仕切壁',                **surface['間仕切壁'],      'area': 8.74 - 3.06},
        {'key': 'LD->台所||間仕切壁',                **surface['間仕切壁'],      'area': 5.46},
        {'key': 'LD->階間(L4)||天井',                **surface['天井'],          'area': 21.53},
        {'key': 'LD->ホール||室内建具',              **surface['室内建具'],      'area': 1.422},
        {'key': 'LD->外部||E_窓',                    **surface['E_窓'],          'area': 2.145},
        {'key': 'LD->外部||S_窓',                    **surface['S_窓'],          'area': 3.465 + 3.465},

        {'key': '台所->外部||E_外壁_一般部',         **surface['E_外壁_一般部'], 'area': (8.46 - 0.98) * 0.83},
        {'key': '台所->外部||E_外壁_熱橋部',         **surface['E_外壁_熱橋部'], 'area': (8.46 - 0.98) * 0.17},
        {'key': '台所->外部||N_外壁_一般部',         **surface['N_外壁_一般部'], 'area': (5.12 - 1.62) * 0.83},
        {'key': '台所->外部||N_外壁_熱橋部',         **surface['N_外壁_熱橋部'], 'area': (5.12 - 1.62) * 0.17},
        {'key': '台所->床下||外皮床_一般部',         **surface['外皮床_一般部'], 'area':  8.28 * 0.83},
        {'key': '台所->床下||外皮床_熱橋部',         **surface['外皮床_熱橋部'], 'area':  8.28 * 0.17},
        {'key': '台所->1階トイレ||間仕切壁',         **surface['間仕切壁'],      'area':  4.09},
        {'key': '台所->ホール||間仕切壁',            **surface['間仕切壁'],      'area':  4.37},
        {'key': '台所->片流れ(3)||外皮天井',         **surface['外皮天井'],      'area':  4.14 + 0.34},
        {'key': '台所->階間(L4)||天井',              **surface['天井'],          'area':  4.14},
        {'key': '台所->ホール||室内建具',            **surface['室内建具'],      'area':  1.422},
        {'key': '台所->外部||E_窓',                  **surface['E_窓'],          'area':  0.98},
        {'key': '台所->外部||N_窓',                  **surface['N_窓'],          'area':  1.62},

        {'key': '浴室->外部||N_外壁_一般部',         **surface['N_外壁_一般部'], 'area':  4.09 * 0.83},
        {'key': '浴室->外部||N_外壁_熱橋部',         **surface['N_外壁_熱橋部'], 'area':  4.09 * 0.17},
        {'key': '浴室->外部||W_外壁_一般部',         **surface['W_外壁_一般部'], 'area':  (4.09 - 0.54) * 0.83},
        {'key': '浴室->外部||W_外壁_熱橋部',         **surface['W_外壁_熱橋部'], 'area':  (4.09 - 0.54) * 0.17},
        {'key': '浴室->床下||外皮床_一般部',         **surface['外皮床_一般部'], 'area':  3.31 * 0.83},
        {'key': '浴室->床下||外皮床_熱橋部',         **surface['外皮床_熱橋部'], 'area':  3.31 * 0.17},
        {'key': '浴室->洗面所||間仕切壁',            **surface['間仕切壁'],      'area':  4.09},
        {'key': '浴室->ホール||間仕切壁',            **surface['間仕切壁'],      'area':  4.09},
        {'key': '浴室->片流れ(3)||外皮天井',         **surface['外皮天井'],      'area':  3.31},
        {'key': '浴室->洗面所||室内建具',            **surface['室内建具'],      'area':  1.422},
        {'key': '浴室->外部||W_窓',                  **surface['W_窓'],          'area':  0.54},

        {'key': '1階トイレ->外部||N_外壁_一般部',    **surface['N_外壁_一般部'], 'area':  (2.05 - 0.54) * 0.83},
        {'key': '1階トイレ->外部||N_外壁_熱橋部',    **surface['N_外壁_熱橋部'], 'area':  (2.05 - 0.54) * 0.17},
        {'key': '1階トイレ->床下||外皮床_一般部',    **surface['外皮床_一般部'], 'area':  1.66 * 0.83},
        {'key': '1階トイレ->床下||外皮床_熱橋部',    **surface['外皮床_熱橋部'], 'area':  1.66 * 0.17},
        {'key': '1階トイレ->ホール||間仕切壁',       **surface['間仕切壁'],      'area':  2.05},
        {'key': '1階トイレ->片流れ(3)||外皮天井',    **surface['外皮天井'],      'area':  1.66},
        {'key': '1階トイレ->ホール||室内建具',       **surface['室内建具'],      'area':  1.422},
        {'key': '1階トイレ->外部||N_窓',             **surface['N_窓'],          'area':  0.54},

        {'key': '洗面所->外部||N_外壁_一般部',       **surface['N_外壁_一般部'], 'area':  (2.05 - 0.54) * 0.83},
        {'key': '洗面所->外部||N_外壁_熱橋部',       **surface['N_外壁_熱橋部'], 'area':  (2.05 - 0.54) * 0.17},
        {'key': '洗面所->床下||外皮床_一般部',       **surface['外皮床_一般部'], 'area':  3.31 * 0.83},
        {'key': '洗面所->床下||外皮床_熱橋部',       **surface['外皮床_熱橋部'], 'area':  3.31 * 0.17},
        {'key': '洗面所->1階トイレ||間仕切壁',       **surface['間仕切壁'],      'area':  4.09},
        {'key': '洗面所->ホール||間仕切壁',          **surface['間仕切壁'],      'area':  4.09},
        {'key': '洗面所->片流れ(3)||外皮天井',       **surface['外皮天井'],      'area':  3.31},
        {'key': '洗面所->ホール||室内建具',          **surface['室内建具'],      'area':  1.422},
        {'key': '洗面所->外部||N_窓',                **surface['N_窓'],          'area':  0.54},

        #{'key': 'ホール->地盤'},
        {'key': 'ホール->外部||N_外壁_一般部',       **surface['N_外壁_一般部'], 'area':  (3.97 + 3.28 - 0.54) * 0.83},
        {'key': 'ホール->外部||N_外壁_熱橋部',       **surface['N_外壁_熱橋部'], 'area':  (3.97 + 3.28 - 0.54) * 0.17},
        {'key': 'ホール->外部||W_外壁_一般部',       **surface['W_外壁_一般部'], 'area':  (5.3 - 1.89) * 0.83},
        {'key': 'ホール->外部||W_外壁_熱橋部',       **surface['W_外壁_熱橋部'], 'area':  (5.3 - 1.89) * 0.17},
        {'key': 'ホール->床下||外皮床_一般部',       **surface['外皮床_一般部'], 'area':  (0.7 + 0.93 + 10.77) * 0.83},
        {'key': 'ホール->床下||外皮床_熱橋部',       **surface['外皮床_一般部'], 'area':  (0.7 + 0.93 + 10.77) * 0.17},
        {'key': 'ホール->和室||間仕切壁',            **surface['間仕切壁'],      'area':  5.46},
        {'key': 'ホール->LD||間仕切壁',              **surface['間仕切壁'],      'area':  8.74},
        {'key': 'ホール->2階ホール||天井',           **surface['天井'],          'area':  2.9},
        {'key': 'ホール->片流れ(3)||外皮天井',       **surface['外皮天井'],      'area':  0.68},
        {'key': 'ホール->階間(L4)||天井',            **surface['天井'],          'area':  2.48 + 7.87},
        {'key': 'ホール->外部||N_窓',                **surface['N_窓'],          'area':  0.54},
        {'key': 'ホール->外部||W_窓',                **surface['W_窓'],          'area':  1.89},

        {'key': 'クローゼット->外部||N_外壁_一般部', **surface['N_外壁_一般部'], 'area':  6.55 * 0.83},
        {'key': 'クローゼット->外部||N_外壁_熱橋部', **surface['N_外壁_熱橋部'], 'area':  6.55 * 0.17},
        {'key': 'クローゼット->外部||W_外壁_一般部', **surface['W_外壁_一般部'], 'area':  (4.37 - 0.54) * 0.83},
        {'key': 'クローゼット->外部||W_外壁_熱橋部', **surface['W_外壁_熱橋部'], 'area':  (4.37 - 0.54) * 0.17},
        {'key': 'クローゼット->寝室||間仕切壁',      **surface['間仕切壁'],      'area':  6.55},
        {'key': 'クローゼット->2階ホール||間仕切壁', **surface['間仕切壁'],      'area':  4.37},
        {'key': 'クローゼット->切妻||外皮天井',      **surface['外皮天井'],      'area':  4.97},
        {'key': 'クローゼット->階間(L4)||床',        **surface['床'],            'area':  4.97},
        {'key': 'クローゼット->寝室||室内建具',      **surface['室内建具'],      'area':  1.422},
        {'key': 'クローゼット->外部||W_窓',          **surface['W_窓'],          'area':  0.54},

        {'key': '寝室->外部||S_外壁_一般部',         **surface['S_外壁_一般部'], 'area':  (8.74 - 1.733) * 0.83},
        {'key': '寝室->外部||S_外壁_熱橋部',         **surface['S_外壁_熱橋部'], 'area':  (8.74 - 1.733) * 0.17},
        {'key': '寝室->外部||W_外壁_一般部',         **surface['W_外壁_一般部'], 'area':  (8.74 - 0.99) * 0.83},
        {'key': '寝室->外部||W_外壁_熱橋部',         **surface['W_外壁_熱橋部'], 'area':  (8.74 - 0.99) * 0.17},
        {'key': '寝室->子供室1||間仕切壁',           **surface['間仕切壁'],      'area':  8.74},
        {'key': '寝室->2階ホール||間仕切壁',         **surface['間仕切壁'],      'area':  2.18},
        {'key': '寝室->切妻||N_外皮天井',            **surface['外皮天井'],      'area': 13.25},
        {'key': '寝室->階間(L4)||床',                **surface['床'],            'area': 13.25},
        {'key': '寝室->2階ホール||室内建具',         **surface['室内建具'],      'area':  1.422},
        {'key': '寝室->外部||S_窓',                  **surface['S_窓'],          'area':  1.733},
        {'key': '寝室->外部||W_窓',                  **surface['W_窓'],          'area':  0.99},

        {'key': '子供室1->外部||S_外壁_一般部',       **surface['S_外壁_一般部'], 'area':  (7.1 - 1.733) * 0.83},
        {'key': '子供室1->外部||S_外壁_熱橋部',       **surface['S_外壁_熱橋部'], 'area':  (7.1 - 1.733) * 0.17},
        {'key': '子供室1->子供室2||間仕切壁',         **surface['間仕切壁'],      'area':  8.74},
        {'key': '子供室1->切妻||外皮天井',            **surface['外皮天井'],      'area': 10.76},
        {'key': '子供室1->階間(L4)||床',              **surface['床'],            'area': 10.76},
        {'key': '子供室1->2階ホール||室内建具',       **surface['室内建具'],      'area':  1.422},
        {'key': '子供室1->外部||S_窓',                **surface['S_窓'],          'area':  1.733},

        {'key': '子供室2->外部||E_外壁_一般部',       **surface['E_外壁_一般部'], 'area':  (8.74 - 0.66) * 0.83},
        {'key': '子供室2->外部||E_外壁_熱橋部',       **surface['E_外壁_熱橋部'], 'area':  (8.74 - 0.66) * 0.17},
        {'key': '子供室2->外部||S_外壁_一般部',       **surface['S_外壁_一般部'], 'area':  (7.1 - 1.733) * 0.83},
        {'key': '子供室2->外部||S_外壁_熱橋部',       **surface['S_外壁_熱橋部'], 'area':  (7.1 - 1.733) * 0.17},
        {'key': '子供室2->切妻||外皮天井',            **surface['外皮天井'],      'area': 10.77},
        {'key': '子供室2->階間(L4)||床',              **surface['床'],            'area': 10.77},
        {'key': '子供室2->2階ホール||室内建具',       **surface['室内建具'],      'area':  1.422},
        {'key': '子供室2->外部||E_窓',                **surface['E_窓'],          'area':  0.66},
        {'key': '子供室2->外部||S_窓',                **surface['S_窓'],          'area':  1.733},

        {'key': '2階ホール->外部||E_外壁_一般部',      **surface['E_外壁_一般部'], 'area':  2.18 * 0.83},
        {'key': '2階ホール->外部||E_外壁_熱橋部',      **surface['E_外壁_熱橋部'], 'area':  2.18 * 0.17},
        {'key': '2階ホール->外部||N_外壁_一般部',      **surface['N_外壁_一般部'], 'area': (11.33 - 0.99) * 0.83},
        {'key': '2階ホール->外部||N_外壁_熱橋部',      **surface['N_外壁_熱橋部'], 'area': (11.33 - 0.99) * 0.17},
        {'key': '2階ホール->子供室1||間仕切壁',        **surface['間仕切壁'],      'area':  7.1},
        {'key': '2階ホール->子供室2||間仕切壁',        **surface['間仕切壁'],      'area':  7.1},
        {'key': '2階ホール->切妻||外皮天井',           **surface['外皮天井'],      'area': 10.77},
        {'key': '2階ホール->片流れ(3)||0_外壁_一般部', **surface['0_外壁_一般部'], 'area': (0.69 + 1.59) * 0.83},
        {'key': '2階ホール->片流れ(3)||0_外壁_熱橋部', **surface['0_外壁_熱橋部'], 'area': (0.69 + 1.59) * 0.17},
        {'key': '2階ホール->階間(L4)||床',             **surface['床'],            'area':  7.87},
        {'key': '2階ホール->2階トイレ||室内建具',      **surface['室内建具'],      'area':  1.422},
        {'key': '2階ホール->外部||N_窓',               **surface['N_窓'],          'area':  0.99},

        {'key': '切妻->外部||E_外壁_一般部',            **surface['E_外壁_一般部'], 'area':  (1.64 + 3.35) * 0.83},
        {'key': '切妻->外部||E_外壁_熱橋部',            **surface['E_外壁_熱橋部'], 'area':  (1.64 + 3.35) * 0.17},
        {'key': '切妻->外部||屋根',                     **surface['屋根'],          'area': 28.6 + 28.6},
        {'key': '切妻->外部||N_外壁_一般部',            **surface['N_外壁_一般部'], 'area':  2.87 * 0.83},
        {'key': '切妻->外部||N_外壁_熱橋部',            **surface['N_外壁_熱橋部'], 'area':  2.87 * 0.17},
        {'key': '切妻->外部||S_外壁_一般部',            **surface['S_外壁_一般部'], 'area':  2.87 * 0.83},
        {'key': '切妻->外部||S_外壁_熱橋部',            **surface['S_外壁_熱橋部'], 'area':  2.87 * 0.17},
        {'key': '切妻->外部||W_外壁_一般部',            **surface['W_外壁_一般部'], 'area':  (1.64 + 3.35) * 0.83},
        {'key': '切妻->外部||W_外壁_熱橋部',            **surface['W_外壁_熱橋部'], 'area':  (1.64 + 3.35) * 0.17},

        {'key': '片流れ(3)->外部||E_外壁_一般部',        **surface['E_外壁_一般部'], 'area':  (0.58 + 0.27) * 0.83},
        {'key': '片流れ(3)->外部||E_外壁_熱橋部',        **surface['E_外壁_熱橋部'], 'area':  (0.58 + 0.27) * 0.17},
        {'key': '片流れ(3)->外部||屋根',                 **surface['屋根'],          'area': 13.16 + 1.02},
        {'key': '片流れ(3)->外部||W_外壁_一般部',        **surface['W_外壁_一般部'], 'area':  (0.58 + 0.27) * 0.83},
        {'key': '片流れ(3)->外部||W_外壁_熱橋部',        **surface['W_外壁_熱橋部'], 'area':  (0.58 + 0.27) * 0.17},
        {'key': '片流れ(3)->階間(L4)||_外皮天井',        **surface['外皮天井'],      'area':  1.82},

        {'key': '片流れ(4)->外部||0_外壁_一般部',        **surface['0_外壁_一般部'],  'area':  1.66 * 0.83},
        {'key': '片流れ(4)->外部||0_外壁_熱橋部',        **surface['0_外壁_熱橋部'],  'area':  1.66 * 0.17},
        {'key': '片流れ(4)->外部||屋根',                 **surface['屋根'],           'area':  5.66},
        {'key': '片流れ(4)->外部||S_外壁_一般部',        **surface['S_外壁_一般部'],  'area':  0.21 * 0.83},
        {'key': '片流れ(4)->外部||S_外壁_熱橋部',        **surface['S_外壁_熱橋部'],  'area':  0.21 * 0.17},

        {'key': '階間(L4)->外部||E_外壁_一般部',         **surface['E_外壁_一般部'],  'area':  2.73 * 0.83},
        {'key': '階間(L4)->外部||E_外壁_熱橋部',         **surface['E_外壁_熱橋部'],  'area':  2.73 * 0.17},
        {'key': '階間(L4)->外部||N_外壁_一般部',         **surface['N_外壁_一般部'],  'area':  1.37 * 0.83},
        {'key': '階間(L4)->外部||N_外壁_熱橋部',         **surface['N_外壁_熱橋部'],  'area':  1.37 * 0.17},
        {'key': '階間(L4)->外部||S_外壁_一般部',         **surface['S_外壁_一般部'],  'area':  4.78 * 0.83},
        {'key': '階間(L4)->外部||S_外壁_熱橋部',         **surface['S_外壁_熱橋部'],  'area':  4.78 * 0.17},
        {'key': '階間(L4)->外部||W_外壁_一般部',         **surface['W_外壁_一般部'],  'area':  0.25 * 0.83},
        {'key': '階間(L4)->外部||W_外壁_熱橋部',         **surface['W_外壁_熱橋部'],  'area':  0.25 * 0.17},
        {'key': '階間(L4)->2階ホール||床',               **surface['床'],             'area':  0.46 + 1.59 + 0.46},
        {'key': '階間(L4)->片流れ(4)||0_外壁_一般部',    **surface['0_外壁_一般部'],  'area':  2.48 * 0.83},
        {'key': '階間(L4)->片流れ(4)||0_外壁_熱橋部',    **surface['0_外壁_熱橋部'],  'area':  2.48 * 0.17},

        {'key': '2階トイレ->外部||E_外壁_一般部',        **surface['E_外壁_一般部'],  'area':  2.18 * 0.83},
        {'key': '2階トイレ->外部||E_外壁_熱橋部',        **surface['E_外壁_熱橋部'],  'area':  2.18 * 0.17},
        {'key': '2階トイレ->外部||N_外壁_一般部',        **surface['N_外壁_一般部'],  'area':  (4.12 - 0.54) * 0.83},
        {'key': '2階トイレ->外部||N_外壁_熱橋部',        **surface['N_外壁_熱橋部'],  'area':  (4.12 - 0.54) * 0.17},
        {'key': '2階トイレ->2階ホール||間仕切壁',        **surface['間仕切壁'],       'area':  4.37 + 2.18},
        {'key': '2階トイレ->切妻||外皮天井',             **surface['外皮天井'],       'area':  1.66},
        {'key': '2階トイレ->片流れ(3)||0_外壁_一般部',   **surface['0_外壁_一般部'],  'area':  0.25 * 0.83},
        {'key': '2階トイレ->片流れ(3)||0_外壁_熱橋部',   **surface['0_外壁_熱橋部'],  'area':  0.25 * 0.17},
        {'key': '2階トイレ->階間(L4)||床',               **surface['床'],             'area':  1.66},
        {'key': '2階トイレ->外部||N_窓',                 **surface['E_窓'],           'area':  0.54},
    ]

    vt.build_config(input_data) 


if __name__ == "__main__":
    parser = argparse.ArgumentParser()
    parser.add_argument("--hasp", default="3639999.has")
    parser.add_argument("--lat", type=float, default=35.681236)
    parser.add_argument("--lon", type=float, default=139.767125)
    args = parser.parse_args()
    main(args.hasp, args.lat, args.lon)
